#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev-portal.data.konnect_portal_list.my_portallist: Reading...
module.control-planes.konnect_gateway_control_plane.cps["staging"]: Refreshing state... [id=5cc9e2bb-faed-4109-94fc-74f9285f6290]
module.control-planes.konnect_gateway_control_plane.cps["dev"]: Refreshing state... [id=0df2812e-4b71-49c1-83ca-7c9e8f0e9c43]
module.dev-portal.konnect_application_auth_strategy.keyauth: Refreshing state... [id=f27fb1d2-4776-436b-ab2d-d31471dcca81]
module.control-planes.konnect_gateway_control_plane.cps["home_cluster"]: Refreshing state... [id=99461c4a-eda0-4025-97e9-bd039d3ecf2f]
module.control-planes.konnect_mesh_control_plane.tf_global_cp: Refreshing state... [id=0616e60c-3d2a-458a-8da5-0cecbcb05d52]
module.dev-portal.konnect_application_auth_strategy.oidc: Refreshing state... [id=a23a6caa-c9f5-4db2-8b69-3df201349af9]
module.dev-portal.data.konnect_portal_list.my_portallist: Read complete after 1s
module.dev-portal.konnect_api_product.echo: Refreshing state... [id=47779605-3533-47d9-a35d-51860b10fa6a]
module.dev-portal.konnect_api_product.httpbin: Refreshing state... [id=65a4d875-01a4-4740-a235-e67d5b1502f6]
module.gateway-configs.konnect_gateway_service.httpbin: Refreshing state... [id=5c67f486-0025-40c4-ba26-e50715a47c43]
module.gateway-configs.konnect_gateway_consumer.alex: Refreshing state... [id=c00f8ddf-782d-4df9-befc-6b83fe1036e4]
module.gateway-configs.konnect_gateway_consumer.alice: Refreshing state... [id=c4af45b4-c592-48a0-91dc-62341102b66d]
module.gateway-configs.konnect_gateway_route.catch_all: Refreshing state... [id=5da78168-60ce-4a98-8e8d-d8c76a0c0e92]
module.dev-portal.konnect_portal.my_portal: Refreshing state... [id=22723cee-27f7-490b-9f01-3bd312b2bafb]
module.gateway-configs.konnect_gateway_service.echo: Refreshing state... [id=0cab2efc-c7d0-4313-99a1-eab303aa4022]
module.gateway-configs.konnect_gateway_key_auth.alex_keyauth: Refreshing state... [id=1b1ce517-1a3a-44f9-9b3a-4ba923890c0f]
module.gateway-configs.konnect_gateway_basic_auth.alex_basicauth: Refreshing state... [id=7c6d0208-38d9-46b0-b828-93025593d27c]
module.gateway-configs.konnect_gateway_basic_auth.alice_basicauth: Refreshing state... [id=c0078009-10e1-44a6-80a6-6476d402ec30]
module.gateway-configs.konnect_gateway_key_auth.alice_keyauth: Refreshing state... [id=a43139bf-1053-4aa2-89cf-a741dce6a803]
module.gateway-configs.konnect_gateway_plugin_key_auth.key_auth: Refreshing state... [id=343d10e1-c1ad-4b18-a5cc-a2bbb38a863c]
module.gateway-configs.konnect_gateway_route.echo: Refreshing state... [id=7cb81d2e-cc29-4ac2-b81f-5ff1fcb49c5b]
module.dev-portal.konnect_api_product_version.echo_v1: Refreshing state... [id=094d9a39-4259-4bb4-9df0-5c018e8ef3ac]
module.gateway-configs.konnect_gateway_plugin_request_termination.catch_all_terminate: Refreshing state... [id=86b3a813-ae39-4671-a762-b05e582a0c5c]
module.gateway-configs.konnect_gateway_plugin_basic_auth.basic_auth: Refreshing state... [id=0fa3f7cc-1bca-40da-ac30-29de0fd6bab3]
module.gateway-configs.konnect_gateway_route.httpbin: Refreshing state... [id=fefa8265-12f3-476e-8834-c2ddf3bee646]
module.dev-portal.konnect_api_product_version.httpbin_v1: Refreshing state... [id=f397cd99-0a4c-43f4-993d-133295b84039]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["dev"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = "0df2812e-4b71-49c1-83ca-7c9e8f0e9c43"
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["home_cluster"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = "99461c4a-eda0-4025-97e9-bd039d3ecf2f"
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.control-planes.konnect_gateway_data_plane_client_certificate.fomm_rsa_root_ca["staging"] will be created
  + resource "konnect_gateway_data_plane_client_certificate" "fomm_rsa_root_ca" {
      + cert             = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIF6zCCA9OgAwIBAgIUHQlIjxxhwJEpa+bpHMbGcrJdh2UwDQYJKoZIhvcNAQEL
            BQAwfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3RvcmlhMRIwEAYDVQQHDAlN
            ZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYDVQQLDBBmb01NIFJTQSBS
            b290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENBMB4XDTIxMDcwNzExMDkx
            MVoXDTQxMDcwMjExMDkxMVowfTELMAkGA1UEBhMCQVUxETAPBgNVBAgMCFZpY3Rv
            cmlhMRIwEAYDVQQHDAlNZWxib3VybmUxETAPBgNVBAoMCGZvTU0gTHRkMRkwFwYD
            VQQLDBBmb01NIFJTQSBSb290IENBMRkwFwYDVQQDDBBmb01NIFJTQSBSb290IENB
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAx0W8j/3/ErEbR4leh4dv
            qEloKxx8aFo3RoETS5AWtSN+f0NjWZDw9o+5ipmd/IaHNOXLPDCUSWZYl7rjT88m
            eUmQvsO7C7tjiBRERFiJHMmoFwY99g8TADR58mTvVOw58PrgWBtMLYSLa4D2bwt0
            X4ZQi0t6NE2LdUF1Ts0iKkjNSoTzcwBTX3RgYnMfSn3VHatu9qre/Xy2Yl7erGzo
            h+Y3mQpEa1/vIA9X+j/wX5tBkJ6RxEvCffNOjd1wG3s0U8VPyRcUiTuKqSh+smtq
            xeQNUhUAfigh0O8X6iGx5l/2Un6EzsJ27ScY4ynYx51W1lSwwr7/GObm57Bivpvn
            1n6YoMQ23Afsx/NDxUsBnKt7FxXzQwNwqluqj/+PNykIYvdPJsjqYxNrQUzKUy/Y
            VqiNhL2K3uxYGTg1dCl7fk9tXqj3Kpu/upqVdSRBg1Ej9L+U/zoSPj1JWzMNp/Gt
            T2xUZ1lNm3aNQiNvRMl95JAalsaGhVGIqemGy0oJqKcSuuUfe7rChOkWr09g3e7V
            psQZnV9sWYseLrFxwoxPlSYBg19Wd5xCVnNht+RgjpP6Q29rax6xkVvxw4LKc1Ce
            56T+Py5IIBZ71l/8zpKOWov2C97dV/kVtJ8+LpbVJ6p7C82wShO1y8wGv9+KU5xf
            Ldajk5D4TE8apDYXlHGrfnUCAwEAAaNjMGEwHQYDVR0OBBYEFECo5LRGmunPA5pB
            qwJq5inA6OUUMB8GA1UdIwQYMBaAFECo5LRGmunPA5pBqwJq5inA6OUUMA8GA1Ud
            EwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMA0GCSqGSIb3DQEBCwUAA4ICAQC3
            cD5tOqlF1ZjzjYfpK17lTO3SiBHQQmW+oH3UNUCFsut/s6rzxnc0bpIB6OT0Pn3s
            xQWTwEMdFAvfhIzj+zeLRVP6WsidppikRmoKLjZjru4E6YlWA9Tdcgs2abrB824c
            0iRl291AcrZYpFEWL7k8r3Lr9yXIlvHUhjEgn5ShDbd7/F/68QTxU5CtqE0z9Go+
            3BM+8LUYvQsUaEnGUsNAR2BcSLwkXi0+IpKXztyRHhn+hOHOIW3/4FbCCJDtVjst
            xHVF7EwxqjmNboIdqnBlsLle/tIcApuh/VapZpj+3AdHdCMHDPGSpvryia+fZI0S
            Tv3sDOaW918rhki0ARoMOBMKPmu1UigFQ3NrocPV6/Fk7M9uYgyTFSVN9kvRxAbJ
            oMp2rMKVjxhxd1K70jPwzbnXnGr83s9cFbbDZb1tPflpqJy5gHlDIGkY0Gc+W3yL
            h+fVgQYZ+ZfUhc7S156NvWWYy3FV+ZaGqySef2XAVKtkzNXWON5pao/FxGytlnck
            OynrqUkMeZInb11+A5P4NhgFUHjFfnyGaVwquoAMl78757iYAju/aVr3Rg5+695B
            wmqmEmjkZ4nKrQRMOiHdCXc1+I188IM1uPXPqdFT7kaZeTJEMkBQ2wy4Qpi95Tlw
            WYmHySjRqWVdgwZ64yXHgOglBmgNk76g4VNmZ9Z36Q==
            -----END CERTIFICATE-----
        EOT
      + control_plane_id = "5cc9e2bb-faed-4109-94fc-74f9285f6290"
      + created_at       = (known after apply)
      + id               = (known after apply)
      + updated_at       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*